Autodesk.Revit.DB.ViewSheetSetting.Revert
Revert the current view sheet set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current view sheet set is In-Session.

Autodesk.Revit.DB.ViewSheetSetting.Delete
Delete the current view sheet set, and make the In-Session set as the current one.
Returns: False if Delete operation fails, otherwise True.
Remarks: If the current view sheet set is In-Session, an InvalidOperationException
will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current view sheet set is In-Session.

Autodesk.Revit.DB.ViewSheetSetting.Rename(System.String)
Rename the current view sheet set.
newName: View sheet set name to be renamed as.
Returns: False if Rename operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the input name is already existed in current view sheet set list.

Autodesk.Revit.DB.ViewSheetSetting.SaveAs(System.String)
Save the current view sheet set to another view sheet set with the specified name.
newName: View sheet set name to be saved as.
Returns: False if Save As operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the input name is already existed in current view sheet set list.

Autodesk.Revit.DB.ViewSheetSetting.Save
Save the changes for the current view sheet set.
Returns: False if save operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current view sheet set is In-Session or the current view sheet set is unchanged.

Autodesk.Revit.DB.ViewSheetSetting.InSession
The in-session view sheet set of Print Setup.

Autodesk.Revit.DB.ViewSheetSetting.AvailableViews
All views that can be printed.
Remarks: Users can select the view/sheet from this view set to printing.

Autodesk.Revit.DB.ViewSheetSetting.CurrentViewSheetSet
The current view sheet set of PrintSetup.

Autodesk.Revit.DB.ViewSheetSetting
Represents the View/Sheet Set (Application Menu->Print) within Autodesk Revit.